import matplotlib.pyplot as plt
import numpy as np


# Функція для побудови кривої Парето
def plot_pareto(data, labels, title):
    # Сортуємо дані за спаданням
    data = sorted(data, reverse=True)
    labels = [labels[i] for i in np.argsort(-np.array(data))]

    # Обчислюємо кумулятивну суму
    cumulative_sum = np.cumsum(data)

    # Нормалізуємо кумулятивну суму
    cumulative_sum = cumulative_sum / cumulative_sum[-1] * 100

    # Створюємо фігуру та вісі
    fig, ax1 = plt.subplots(figsize=(10, 9))
    plt.xticks(rotation='vertical')
    plt.subplots_adjust(bottom=0.45)

    # Створюємо другу вісь для кумулятивної суми
    ax2 = ax1.twinx()

    # Будуємо стовпчикову діаграму
    ax1.bar(labels, data, alpha=0.5)
    ax1.set_xlabel('Проблеми')
    ax1.set_ylabel('Значення')
    ax1.set_title(title)

    # Будуємо криву Парето
    ax2.plot(labels, cumulative_sum, 'r--', linewidth=2)
    ax2.set_ylabel('Кумулятивна сума (%)')
    ax2.set_ylim(0, 100)

    # Налаштовуємо підписи на осях



    plt.show()


# Функція для АВС-аналізу
def abc_analysis(data):
    # Сортуємо дані за спаданням
    data = sorted(data, reverse=True)

    # Обчислюємо кумулятивну суму
    cumulative_sum = np.cumsum(data)

    # Визначаємо межі для груп A, B, C
    total_sum = sum(data)
    a_limit = 0.8 * total_sum
    b_limit = 0.95 * total_sum

    # Ініціалізуємо групи
    group_a = []
    group_b = []
    group_c = []

    # Розподіляємо елементи за групами
    current_sum = 0
    for value in data:
        current_sum += value
        if current_sum <= a_limit:
            group_a.append(value)
        elif current_sum <= b_limit:
            group_b.append(value)
        else:
            group_c.append(value)

    return group_a, group_b, group_c


# Жителі будинку
values11 = [1.0, 0.89, 0.84, 0.80, 0.69, 0.69, 0.66, 0.57, 0.46, 0.46, 0.43, 0.34, 0.34, 0.23, 0.23]
labels11 = ['Безпека дітей у будинку', 'Захист від злому та крадіжок', 'Протипожежна безпека',
            'Сигналізація проти витоку газу/диму/речовин', 'Контроль доступу в будинок',
            'Безпечне зберігання цінних речей/зброї', 'Відеоспостереження території',
            'Безпечне поводження з хімікатами',
            'Резервне живлення', 'Екологічна безпека', 'Захист від електромагнітного випромінювання',
            'Захист від стихійних лих', 'Безпека при ремонтних роботах', 'Контроль активності домашніх тварин',
            'Захист від шуму та вібрацій']

# Гості
values12 = \
    [1.0, 1.0, 0.88, 0.88, 0.75, 0.75, 0.75, 0.63, 0.63, 0.63, 0.5, 0.5, 0.38, 0.38, 0.38]
labels12 = \
    ['Контроль доступу гостей на територію', 'Забезпечення безпеки дітей-гостей', 'Захист конфіденційності гостей',
     'Захист майна гостей від крадіжок', 'Інформування про евакуаційні шляхи', 'Контроль за вживанням алкоголю',
     'Евакуаційний план для гостей', 'Безпечне розміщення гостей', 'Інструкції та інформування з безпеки',
     'Інформування про правила поведінки', 'Медична допомога для гостей', 'Захист від алергенів для гостей',
     'Окремі безпечні зони для гостей', 'Безпечне паркування для транспорту', 'Безпечні розважальні заходи']

# Люди, які реалізують безпеку
values13 = \
    [1.0, 1.0, 0.88, 0.88, 0.75, 0.75, 0.75, 0.63, 0.63, 0.5, 0.5, 0.5, 0.5, 0.38, 0.38]
labels13 = \
    ['Забезпечення засобами захисту', 'Захист конфіденційної інформації', "Чітке розмежування обов'язків",
     'Юридична підтримка дій персоналу', 'Взаємодія з правоохоронцями', 'Професійний відбір персоналу',
     'Страхування ризиків для персоналу', 'Належні умови праці персоналу', 'Психологічний моніторинг персоналу',
     'Регулярне навчання персоналу', "Ротація персоналу між об'єктами/зонами", 'Своєчасне оновлення обладнання',
     'Ротація зон відповідальності', 'Медичний контроль персоналу', 'Облік робочого часу персоналу']

# Жителі будинку
values21 = \
    [1.0, 0.98, 0.76, 0.56, 0.44, 0.44, 0.44, 0.39, 0.28, 0.28, 0.28, 0.18, 0.18, 0.13, 0.11]
labels21 = \
    ['Безпека дітей у будинку', 'Захист від злому та крадіжок', 'Протипожежна безпека',
     'Сигналізація проти витоку газу/диму/речовин', 'Контроль доступу в будинок', 'Відеоспостереження території',
     'Безпечне зберігання цінних речей/зброї', 'Безпечне поводження з хімікатами', 'Резервне живлення',
     'Захист від електромагнітного випромінювання', 'Екологічна безпека', 'Захист від стихійних лих',
     'Безпека при ремонтних роботах', 'Захист від шуму та вібрацій', 'Контроль активності домашніх тварин']

# Гості
values22 = [1.0, 0.90, 0.75, 0.75, 0.75, 0.62, 0.62, 0.60, 0.47, 0.47, 0.47, 0.38, 0.35, 0.25, 0.25]
labels22 = ['Контроль доступу гостей на територію', 'Забезпечення безпеки дітей-гостей',
            'Захист конфіденційності гостей',
            'Захист майна гостей від крадіжок', 'Інструкції та інформування з безпеки',
            'Інформування про евакуаційні шляхи', 'Контроль за вживанням алкоголю', 'Медична допомога для гостей',
            'Окремі безпечні зони для гостей', 'Безпечне розміщення гостей', 'Інформування про правила поведінки',
            'Захист від алергенів для гостей', 'Безпечне паркування для транспорту', 'Безпечні розважальні заходи',
            'Евакуаційний план для гостей']

# Люди, які реалізують безпеку
values23 = [1.0, 1.0, 0.98, 0.81, 0.81, 0.67, 0.67, 0.65, 0.51, 0.51, 0.41, 0.41, 0.41, 0.41, 0.27]
labels23 = ['Професійний відбір персоналу', 'Захист конфіденційної інформації', 'Забезпечення засобами захисту',
            'Своєчасне оновлення обладнання', 'Юридична підтримка дій персоналу', 'Регулярне навчання персоналу',
            'Страхування ризиків для персоналу', 'Взаємодія з правоохоронцями', 'Належні умови праці персоналу',
            'Психологічний моніторинг персоналу', "Ротація персоналу між об'єктами/зонами",
            "Ротація зон відповідальності", "Чітке розмежування обов'язків", 'Медичний контроль персоналу',
            'Облік робочого часу персоналу']

# Жителі будинку
values31 = \
    [1.0, 1.0, 0.8, 0.6, 0.53, 0.47, 0.47, 0.47, 0.4, 0.27, 0.27, 0.2, 0.2, 0.13, 0.13]
labels31 = ['Захист від злому та крадіжок', 'Безпека дітей у будинку', 'Протипожежна безпека',
            'Сигналізація проти витоку газу/диму/речовин', 'Контроль доступу в будинок',
            'Безпечне зберігання цінних речей/зброї', 'Відеоспостереження території',
            'Безпечне поводження з хімікатами',
            'Резервне живлення', 'Захист від електромагнітного випромінювання', 'Екологічна безпека',
            'Захист від стихійних лих', 'Безпека при ремонтних роботах', 'Контроль активності домашніх тварин',
            'Захист від шуму та вібрацій']

# Гості
values32 = [1.0, 0.92, 0.75, 0.75, 0.75, 0.58, 0.58, 0.58, 0.58, 0.42, 0.42, 0.33, 0.33, 0.25, 0.25]
labels32 = ['Контроль доступу гостей на територію', 'Забезпечення безпеки дітей-гостей',
            'Захист конфіденційності гостей',
            'Захист майна гостей від крадіжок', 'Інструкції та інформування з безпеки',
            'Інформування про евакуаційні шляхи', 'Контроль за вживанням алкоголю', 'Евакуаційний план для гостей',
            'Медична допомога для гостей', 'Інформування про правила поведінки', 'Окремі безпечні зони для гостей',
            'Захист від алергенів для гостей', 'Безпечне розміщення гостей', 'Безпечне паркування для транспорту',
            'Безпечні розважальні заходи']

# Люди, які реалізують безпеку
values33 = [1.0, 1.0, 0.9, 1.0, 0.8, 0.8, 0.7, 0.7, 0.7, 0.5, 0.5, 0.5, 0.4, 0.4, 0.3]
labels33 = ['Професійний відбір персоналу', 'Захист конфіденційної інформації', 'Своєчасне оновлення обладнання',
            'Забезпечення засобами захисту', "Чітке розмежування обов'язків", 'Юридична підтримка дій персоналу',
            'Взаємодія з правоохоронцями', 'Регулярне навчання персоналу', 'Страхування ризиків для персоналу',
            'Належні умови праці персоналу', 'Психологічний моніторинг персоналу',
            "Ротація персоналу між об'єктами/зонами", 'Медичний контроль персоналу', 'Ротація зон відповідальності',
            'Облік робочого часу персоналу']

plot_pareto(values11, labels11, 'Крива Парето метод Покер-Планування Жителі будинку')
plot_pareto(values12, labels12, 'Крива Парето метод Покер-Планування Гості')
plot_pareto(values13, labels13, 'Крива Парето метод Покер-Планування Люди відповідальні за безпеку')

plot_pareto(values21, labels21, 'Крива Парето метод Постійної суми Жителі будинку')
plot_pareto(values22, labels22, 'Крива Парето метод Постійної суми Гості')
plot_pareto(values23, labels23, 'Крива Парето метод Постійної суми Люди відповідальні за безпеку')

plot_pareto(values31, labels31, 'Крива Парето метод Парного порівняння Жителі будинку')
plot_pareto(values32, labels32, 'Крива Парето метод Парного порівняння Гості')
plot_pareto(values33, labels33, 'Крива Парето метод Парного порівняння Люди відповідальні за безпеку')

group_a, group_b, group_c = abc_analysis(values11)
print("Група A:", group_a)
print("Група B:", group_b)
print("Група C:", group_c)
